## Plan Result (prod_appgw)




<pre><code>Plan: 0 to add, 1 to change, 0 to destroy.</code></pre>

* Update
  * azurerm_application_gateway.this




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_application_gateway.this will be updated in-place
  ~ resource "azurerm_application_gateway" "this" {
        id                                = "/subscriptions/17390ec1-5a5e-4a20-afb3-38d8d726ae45/resourceGroups/crime-portal-rg-prod/providers/Microsoft.Network/applicationGateways/crime-portal-appgw-prod"
        name                              = "crime-portal-appgw-prod"
        tags                              = {
            "application"  = "crime-portal"
            "builtFrom"    = "hmcts/crime-portal-infra"
            "businessArea" = "cross-cutting"
            "criticality"  = "High"
            "environment"  = "production"
            "startupMode"  = "always"
        }
        # (7 unchanged attributes hidden)

      - http_listener {
          - frontend_ip_configuration_id   = "/subscriptions/17390ec1-5a5e-4a20-afb3-38d8d726ae45/resourceGroups/crime-portal-rg-prod/providers/Microsoft.Network/applicationGateways/crime-portal-appgw-prod/frontendIPConfigurations/crime-portal-private-prod" -> null
          - frontend_ip_configuration_name = "crime-portal-private-prod" -> null
          - frontend_port_id               = "/subscriptions/17390ec1-5a5e-4a20-afb3-38d8d726ae45/resourceGroups/crime-portal-rg-prod/providers/Microsoft.Network/applicationGateways/crime-portal-appgw-prod/frontendPorts/http" -> null
          - frontend_port_name             = "http" -> null
          - host_names                     = [] -> null
          - id                             = "/subscriptions/17390ec1-5a5e-4a20-afb3-38d8d726ae45/resourceGroups/crime-portal-rg-prod/providers/Microsoft.Network/applicationGateways/crime-portal-appgw-prod/httpListeners/crime-portal-http-listener" -> null
          - name                           = "crime-portal-http-listener" -> null
          - protocol                       = "Http" -> null
          - require_sni                    = false -> null
        }
      - http_listener {
          - frontend_ip_configuration_id   = "/subscriptions/17390ec1-5a5e-4a20-afb3-38d8d726ae45/resourceGroups/crime-portal-rg-prod/providers/Microsoft.Network/applicationGateways/crime-portal-appgw-prod/frontendIPConfigurations/crime-portal-private-prod" -> null
          - frontend_ip_configuration_name = "crime-portal-private-prod" -> null
          - frontend_port_id               = "/subscriptions/17390ec1-5a5e-4a20-afb3-38d8d726ae45/resourceGroups/crime-portal-rg-prod/providers/Microsoft.Network/applicationGateways/crime-portal-appgw-prod/frontendPorts/https" -> null
          - frontend_port_name             = "https" -> null
          - host_names                     = [] -> null
          - id                             = "/subscriptions/17390ec1-5a5e-4a20-afb3-38d8d726ae45/resourceGroups/crime-portal-rg-prod/providers/Microsoft.Network/applicationGateways/crime-portal-appgw-prod/httpListeners/crime-portal-https-listener" -> null
          - name                           = "crime-portal-https-listener" -> null
          - protocol                       = "Https" -> null
          - require_sni                    = false -> null
          - ssl_certificate_id             = "/subscriptions/17390ec1-5a5e-4a20-afb3-38d8d726ae45/resourceGroups/crime-portal-rg-prod/providers/Microsoft.Network/applicationGateways/crime-portal-appgw-prod/sslCertificates/crimeportal-libra-gw-prod-internal-hmcts-net" -> null
          - ssl_certificate_name           = "crimeportal-libra-gw-prod-internal-hmcts-net" -> null
        }
      + http_listener {
          + frontend_ip_configuration_id   = (known after apply)
          + frontend_ip_configuration_name = "crime-portal-private-prod"
          + frontend_port_id               = (known after apply)
          + frontend_port_name             = "Http"
          + host_names                     = []
          + id                             = (known after apply)
          + name                           = "crime-portal-http-listener"
          + protocol                       = "Http"
          + ssl_certificate_id             = (known after apply)
          + ssl_profile_id                 = (known after apply)
        }
      + http_listener {
          + frontend_ip_configuration_id   = (known after apply)
          + frontend_ip_configuration_name = "crime-portal-private-prod"
          + frontend_port_id               = (known after apply)
          + frontend_port_name             = "https"
          + host_names                     = []
          + id                             = (known after apply)
          + name                           = "crime-portal-https-listener"
          + protocol                       = "Https"
          + ssl_certificate_id             = (known after apply)
          + ssl_certificate_name           = "lets_encrypt"
          + ssl_profile_id                 = (known after apply)
        }

      - probe {
          - id                                        = "/subscriptions/17390ec1-5a5e-4a20-afb3-38d8d726ae45/resourceGroups/crime-portal-rg-prod/providers/Microsoft.Network/applicationGateways/crime-portal-appgw-prod/probes/http" -> null
          - interval                                  = 20 -> null
          - minimum_servers                           = 0 -> null
          - name                                      = "http" -> null
          - path                                      = "/" -> null
          - pick_host_name_from_backend_http_settings = true -> null
          - port                                      = 0 -> null
          - protocol                                  = "Http" -> null
          - timeout                                   = 15 -> null
          - unhealthy_threshold                       = 3 -> null

          - match {
              - status_code = [] -> null
            }
        }
      - probe {
          - id                                        = "/subscriptions/17390ec1-5a5e-4a20-afb3-38d8d726ae45/resourceGroups/crime-portal-rg-prod/providers/Microsoft.Network/applicationGateways/crime-portal-appgw-prod/probes/https" -> null
          - interval                                  = 20 -> null
          - minimum_servers                           = 0 -> null
          - name                                      = "https" -> null
          - path                                      = "/" -> null
          - pick_host_name_from_backend_http_settings = true -> null
          - port                                      = 443 -> null
          - protocol                                  = "Https" -> null
          - timeout                                   = 15 -> null
          - unhealthy_threshold                       = 3 -> null

          - match {
              - status_code = [] -> null
            }
        }
      + probe {
          + id                                        = "/subscriptions/17390ec1-5a5e-4a20-afb3-38d8d726ae45/resourceGroups/crime-portal-rg-prod/providers/Microsoft.Network/applicationGateways/crime-portal-appgw-prod/probes/http"
          + interval                                  = 20
          + minimum_servers                           = 0
          + name                                      = "http"
          + path                                      = "/"
          + pick_host_name_from_backend_http_settings = true
          + protocol                                  = "Http"
          + timeout                                   = 15
          + unhealthy_threshold                       = 3
        }

      ~ rewrite_rule_set {
            id   = "/subscriptions/17390ec1-5a5e-4a20-afb3-38d8d726ae45/resourceGroups/crime-portal-rg-prod/providers/Microsoft.Network/applicationGateways/crime-portal-appgw-prod/rewriteRuleSets/x_fwded_proto"
          ~ name = "x_fwded_proto" -> "crime-portal-rewrites"

          ~ rewrite_rule {
              ~ name          = "x_fwded_proto" -> "crime-portal-location-rewrite"
                # (1 unchanged attribute hidden)

              - request_header_configuration {
                  - header_name  = "X-Forwarded-Proto" -> null
                  - header_value = "https" -> null
                }
              - request_header_configuration {
                  - header_name  = "X-Forwarded-Port" -> null
                  - header_value = "443" -> null
                }
              - request_header_configuration {
                  - header_name  = "X-Forwarded-For" -> null
                  - header_value = "{var_add_x_forwarded_for_proxy}" -> null
                }

              + response_header_configuration {
                  + header_name  = "Location"
                  + header_value = "https://crimeportal.apps.hmcts.net"
                }
            }
        }
      + rewrite_rule_set {
          + name = "x_fwded_proto"

          + rewrite_rule {
              + name          = "x_fwded_proto"
              + rule_sequence = 100

              + request_header_configuration {
                  + header_name  = "X-Forwarded-Proto"
                  + header_value = "https"
                }
              + request_header_configuration {
                  + header_name  = "X-Forwarded-Port"
                  + header_value = "443"
                }
              + request_header_configuration {
                  + header_name  = "X-Forwarded-For"
                  + header_value = "{var_add_x_forwarded_for_proxy}"
                }
            }
        }

      - ssl_certificate {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + ssl_certificate {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + ssl_certificate {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }

        # (13 unchanged blocks hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":56,"Program":"tfcmt","SHA1":"","Target":"prod_appgw","Vars":{}} -->